# SolidCurveIntersectionOptions Class

---
This class contains the options used to calculate the intersection between a solid and a curve.
SystemObject Autodesk.Revit.DBSolidCurveIntersectionOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SolidCurveIntersectionOptions : IDisposable

    Public Class SolidCurveIntersectionOptions
    	Implements IDisposable

    public ref class SolidCurveIntersectionOptions : IDisposable

    type SolidCurveIntersectionOptions =
        class
            interface IDisposable
        end
The SolidCurveIntersectionOptions type exposes the following members.
| Name| Description
---|---|---
| SolidCurveIntersectionOptions|  Constructs a new SolidCurveIntersectionMode with default settings.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ResultType|  The type of results expected by the calculation. The default is CurveSegmentsInside.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SolidCurveIntersectionOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace